Autodesk.Revit.DB.GradientBackgroundSettings.GroundColor
The color of the ground.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.GradientBackgroundSettings.HorizonColor
The color of the horizon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.GradientBackgroundSettings.SkyColor
The color of the top of the sky.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014